# """
# Homebrew Bundle Brewfile.
# Updated 2022-02-24.
#
# @section ilmbase deprecation (due to neofetch):
#
# This is currently required for neofetch, and is safe to remove.
# > brew uninstall --ignore-dependencies ilmbase
# """

# Taps {{{1
# ==============================================================================

tap "homebrew/bundle"
tap "homebrew/core"

# Brews {{{1
# ==============================================================================

brew "nghttp2", link: false  # libnghttp2 / curl
# NOTE Python 3.9 currently required for Google Cloud SDK.
brew "python@3.9", link: false
brew "python@3.10", link: false

brew "ack"
brew "armadillo"
brew "asdf"
brew "autoconf"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"  # rust
brew "bc"
brew "bfg"
brew "bind"  # installs dig
brew "binutils"
brew "black"  # python
brew "bottom"
brew "bpytop"  # python
brew "broot"  # rust
brew "bzip2"
brew "ccache"
brew "cheat"
brew "checkbashisms"
brew "choose-rust"
# > brew "circleci"
brew "cmake"
brew "cmus"
brew "convmv"
brew "coreutils"
brew "curl"
brew "dash"
brew "dog"  # rust
brew "duf"
brew "dust"  # rust
brew "editorconfig"
brew "exa"  # rust
brew "exiftool"
brew "expect"  # installs unbuffer
brew "fd"  # rust
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "flake8"  # python
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdal"
brew "git-lfs"
brew "gitui"
brew "glances"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "go"
brew "gpatch"
brew "gpg"
brew "grep"
brew "groff"
brew "gsl"
brew "gzip"
brew "hadolint"
brew "hdf5"
brew "htop"
brew "httpd"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "igraph"
brew "ilmbase"  # neofetch
brew "imagemagick"
brew "jq"
brew "kakoune"
brew "ksh"
brew "lapack"
brew "leiningen"
brew "lesspipe"
brew "libarchive"
brew "libgit2"
brew "libidn2"  # wget
brew "libnghttp2"  # curl
brew "libomp"
brew "libpsl"  # wget
brew "libressl"
brew "librsvg"
brew "libssh2"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "libxt"  # R Cairo
brew "llvm"
brew "lsd"
brew "lua"
brew "luarocks"
brew "make"
brew "man-db"
brew "mariadb-connector-c"
brew "mcfly"
brew "neofetch"
brew "neovim"
brew "nim"
brew "nmap"
brew "node"
brew "oil"
brew "onefetch"
brew "open-mpi"
brew "openblas"
brew "openjdk"
brew "openjdk@8"  # for nextflow
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pandoc-crossref"
brew "parallel"
brew "pass"
brew "pcre"
# > brew "php"
brew "pipenv"  # python
brew "pkg-config"
brew "podman"
brew "podofo"
brew "poetry"
brew "prettier"  # node
brew "procs"  # rust
brew "proj"
brew "protobuf"
brew "pyenv"
brew "pygments"
brew "pylint"  # python
brew "ranger"  # python
brew "rename"
brew "ripgrep"  # rust
brew "ripgrep-all"  # rust
brew "rsync"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "screen"
brew "sd"
brew "shellcheck"
brew "shellharden"
brew "shunit2"
brew "sox"
brew "sqlite"
brew "sratoolkit"
brew "starship"  # rust
brew "stow"
brew "tcl-tk"
brew "tcsh"
brew "tealdeer"
brew "tesseract"
brew "texinfo"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"  # rust
brew "udunits"
brew "unzip"
brew "v8"
brew "vim"
brew "wget"
brew "xh"
brew "xsv"  # rust
brew "zlib"
brew "zoxide"  # rust
brew "zsh"
