# """
# macOS-specific Homebrew Bundle Brewfile.
# Updated 2022-01-26.
# """

# Taps {{{1
# ==============================================================================

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Priority brews {{{1
# ==============================================================================

brew "emacs", link: false
brew "git"
brew "subversion"

# Casks {{{1
# ==============================================================================

# Previously installed applications not managed by Homebrew intentionally error
# here, and there's no supported method in 'brew bundle install' to force
# an overwrite. Instead, per app run this command manually:
# > brew install --cask --force XXX
# https://github.com/Homebrew/homebrew-bundle/issues/446

# Consider re-enabling, but using AWS primarily at the moment.
# > cask "google-cloud-sdk"

# Required for sshfs, but is insecure.
# > cask "osxfuse"

# Virtualbox is useful but installs a lot of garbage into the system.
# > cask "virtualbox"

# > cask "adobe-acrobat-reader"
# > cask "eloston-chromium"

cask "1password"
cask "airfoil"
cask "alacritty"
cask "alfred"
cask "audio-hijack"
# > cask "bartender"
cask "basictex"
cask "bbedit"
# > cask "bettertouchtool"
cask "bibdesk"
# > cask "bluejeans"
cask "boop"
cask "brave-browser"  # Avoid Keystone bloat from Google Chrome.
cask "carbon-copy-cloner"
cask "coconutbattery"
cask "docker"
cask "easyfind"
cask "emacs"  # no-binaries
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-sans"
cask "font-dejavu"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ia-writer-duospace"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-inconsolata"
cask "font-input"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "github"
cask "google-cloud-sdk", greedy: true
cask "google-drive"
cask "gpg-suite-no-mail"  # no-binaries
cask "hazel"
cask "ibm-aspera-connect"
cask "igv"
cask "iterm2"
cask "julia"
cask "keka"
cask "libreoffice"
cask "little-snitch"
cask "macvim"  # no-binaries
cask "museeks"
cask "netnewswire"
cask "omnidisksweeper"
cask "pacifist"
cask "pycharm-ce"
cask "r"
# > cask "ringcentral"
cask "rstudio"
# > cask "safari-technology-preview"
cask "skype"
cask "sublime-text"
cask "superduper"
# > cask "temurin"  # Using 'openjdk' brew instead.
cask "textmate"
cask "transmit"
cask "tunnelblick"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
# > cask "webex"
cask "xld"
cask "xquartz"
cask "zoom"

# Brews {{{1
# ==============================================================================

# These recipes don't need to be installed on cloud Linux instances.
brew "bandcamp-dl"
brew "flac"
brew "lame"
brew "libiconv"
brew "mas"
brew "mkvtoolnix"
brew "mp4v2"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "osx-cpu-temp"
brew "pinentry-mac"
brew "taglib"
brew "yt-dlp"  # youtube-dl alternative

# External brews {{{1
# ==============================================================================

tap "vitorgalvao/tiny-scripts"
brew "vitorgalvao/tiny-scripts/cask-repair"

# App Store {{{1
# ==============================================================================

# > mas "AdGuard for Safari", id: 1440147259
# > mas "Keynote", id: 409183694
# > mas "Numbers", id: 409203825
# > mas "Pages", id: 409201541

# NOTE [2022-01-03]: These are currently failing. Disabled for the moment.

# > mas "Calca", id: 635758264
# > mas "Disk Speed Test", id: 425264550
# > mas "Gapplin", id: 768053424
# > mas "Internet Access Policy Viewer", id: 1482630322
# > mas "Name Mangler", id: 603637384
# > mas "Pastebot", id: 1179623856
# > mas "Reeder", id: 880001334
# > mas "Soulver", id: 413965349
# > mas "Table Tool", id: 1122008420
# > mas "The Unarchiver", id: 425424353
# > mas "Tweetbot", id: 1384080005
# > mas "iA Writer", id: 775737590
