# """
# macOS-specific Homebrew Bundle Brewfile.
# Updated 2022-04-09.
#
# @section Cask reinstallation:
#
# Previously installed applications not managed by Homebrew intentionally error
# here, and there's no supported method in 'brew bundle install' to force
# an overwrite. Instead, per app run this command manually:
# > brew install --cask --force APP_NAME
#
# See also:
# - https://github.com/Homebrew/homebrew-bundle/issues/446
# """

# Taps {{{1
# ==============================================================================

tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Disabled casks {{{1
# ==============================================================================

# > cask "adobe-acrobat-reader"
# > cask "bettertouchtool"
# > cask "bluejeans"
# > cask "eloston-chromium"
# Consider re-enabling, but using AWS primarily at the moment.
# This also currently requires 'python' brew to be installed.
# > cask "google-cloud-sdk", greedy: true
# Required for sshfs, but is insecure.
# > cask "osxfuse"
# > cask "ringcentral"
# > cask "safari-technology-preview"
# Virtualbox is useful but installs a lot of garbage into the system.
# > cask "virtualbox"
# > cask "webex"

# Casks {{{1
# ==============================================================================

cask "1password"
cask "airfoil"
cask "alacritty"
cask "alfred"
cask "audio-hijack"
cask "bartender"
cask "basictex"
cask "bbedit"
cask "bibdesk"
cask "boop"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "coconutbattery"
cask "docker"
cask "easyfind"
cask "emacs"
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-sans"
cask "font-dejavu"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ia-writer-duospace"
cask "font-ibm-plex"
cask "font-ibm-plex-mono" # requires svn
cask "font-ibm-plex-sans" # requires svn
cask "font-inconsolata"
cask "font-input"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-open-sans" # requires svn
cask "font-roboto" # requires svn
cask "font-roboto-mono" # requires svn
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "github"
cask "gitkraken"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "hazel"
cask "ibm-aspera-connect"
cask "igv"
cask "iterm2-nightly"
cask "julia"
cask "keka"
cask "libreoffice"
cask "little-snitch"
cask "macvim"
cask "museeks"
cask "netnewswire"
cask "nightfall"
cask "omnidisksweeper"
cask "pacifist"
cask "pycharm-ce"
cask "r"
cask "rstudio"
cask "skype"
cask "sublime-text"
cask "superduper"
cask "temurin17"
cask "textmate"
cask "transmit"
cask "tunnelblick"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "xquartz"
cask "zoom"
