# """
# Homebrew (Linuxbrew) Bundle Brewfile.
# Updated 2021-09-14.
#
# Problematic formulas:
# - lapack
# - libiconv
# - libressl
#
# Formula without bottles:
# - emacs
# - proj?
# - gdal
# - mariadb-connector-c
# - openssh
#
# GCC warnings:
# - protobuf
#
# Maybe include:
# - podofo
# """

# Priority brews {{{1
# ==============================================================================

brew "git"
brew "subversion"

# Brews {{{1
# ==============================================================================

brew "ack"
brew "armadillo"
brew "autoconf"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"  # rust
brew "bc"
brew "bfg"
brew "binutils"
brew "black"  # python
brew "bpytop"  # python
brew "broot"  # rust
brew "bzip2"
brew "ccache"
brew "checkbashisms"
brew "circleci"
brew "cmake"
brew "cmus"
brew "convmv"
brew "coreutils"
brew "curl"
brew "dash"
brew "dog"  # rust
brew "dust"  # rust
brew "editorconfig"
brew "exa"  # rust
brew "fd"  # rust
brew "findutils"
brew "fish"
brew "flake8"  # python
brew "fzf"
brew "gawk"
brew "gcc"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "gpatch"
brew "grep"
brew "groff"
brew "gsl"
brew "hadolint"
brew "hdf5"
brew "htop"
brew "igraph"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "lesspipe"
brew "libxt"
brew "llvm"
brew "lua"
brew "luarocks"
brew "make"
brew "man-db"
brew "neofetch"
brew "neovim"
brew "oil"
brew "open-mpi"
brew "openblas"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pass"
brew "pcre"
brew "pipenv"  # python
brew "pkg-config"
brew "procs"  # rust
brew "pylint"  # python
brew "python@3.9"
brew "ranger"  # python
brew "rename"
brew "ripgrep"  # rust
brew "ripgrep-all"  # rust
brew "rsync"
brew "ruby"
brew "screen"
brew "shellcheck"
brew "shellharden"
brew "shunit2"
brew "sqlite"
brew "starship"  # rust
brew "stow"
brew "taglib"
brew "tcl-tk"
brew "tesseract"
brew "texinfo"
brew "tmux"
brew "tokei"  # rust
brew "udunits"
brew "unzip"
brew "vim"
brew "wget"
brew "xsv"  # rust
brew "zlib"
brew "zoxide"  # rust
brew "zsh"
