# """
# Homebrew Bundle Brewfile.
# Updated 2021-05-18.
#
# LLVM:
# LLVM takes up 4 GB of disk space but is required for some Python packages.
# In particular, if we want to install umap-learn, this is now required.
#
# PROJ/GDAL:
# Consider using 'osgeo-gdal' instead of regular 'gdal' brew. This one gets
# updated more regularly. However, I've found that the newer version can
# cause some R packages to fail to build from source.
#
# Rust:
# Use cargo to manage packages instead.
# Use the 'install-rust' script instead of Homebrew 'rustup-init'.
# Don't install 'rust' alongside 'rustup-init'.
#
# See also:
# - https://github.com/Homebrew/homebrew-bundle
# - https://www.caseyliss.com/2019/10/8/brew-bundle
# - https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752
# """

# Taps {{{1
# ==============================================================================

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mongodb/brew"
tap "vitorgalvao/tiny-scripts"

# Priority brews {{{1
# ==============================================================================

brew "git"
# SVN is required for some font casks to install correctly.
brew "subversion"

# Casks {{{1
# ==============================================================================

# Previously installed applications not managed by Homebrew intentionally error
# here, and there's no supported method in 'brew bundle install' to force
# an overwrite. Instead, per app run this command manually:
# > brew install --cask --force XXX
# https://github.com/Homebrew/homebrew-bundle/issues/446

# Consider re-enabling, but using AWS primarily at the moment.
# > cask "google-cloud-sdk"

# Required for sshfs, but is insecure.
# > cask "osxfuse"

# Virtualbox is useful but installs a lot of garbage into the system.
# > cask "virtualbox"

# > cask "adobe-acrobat-reader"
# > cask "google-drive-file-stream"

cask "1password"
cask "adoptopenjdk"
cask "airfoil"
cask "alacritty"
cask "alfred"
cask "audio-hijack"
cask "basictex"
cask "bbedit"
cask "bibdesk"
cask "brave-browser"  # Avoid Keystone bloat from Google Chrome.
cask "carbon-copy-cloner"
cask "coconutbattery"
cask "docker"
cask "easyfind"
cask "eloston-chromium"
cask "emacs"
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-sans"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ia-writer-duospace"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-inconsolata"
cask "font-input"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "github"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"  # no-binaries
cask "hazel"
cask "ibm-aspera-connect"
cask "igv"
cask "iterm2"
cask "julia"
cask "keka"
cask "libreoffice"
cask "little-snitch"
cask "macvim"  # no-binaries
cask "netnewswire"
cask "omnidisksweeper"
cask "pacifist"
cask "pycharm-ce"
cask "r"
cask "rstudio"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "superduper"
cask "textmate"
cask "transmit"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"

# Brews {{{1
# ==============================================================================

# Consider:
# - miniforge
#   https://github.com/conda-forge/miniforge

# Install Rust directly instead.
# > brew "rust"
# > brew "rustup-init"  # rust

# MacVim Cask conflicts with Vim.
# > brew "vim"

# sshfs requires osxfuse cask, which insecurely hooks into system.
# > brew "sshfs"

# CRAN gfortran installs into '/usr/local/gfortran' and links into
# '/usr/local/bin', without an override option.
brew "gcc", link: false

# Use MacGPG (gpg-suite) cask instead.
brew "gpg", link: false

# This conflicts with 'imath' and 'openexr' recipes.
brew "ilmbase", link: false  # neofetch

# Python: Use official Framework binary install instead of Homebrew.
# Use 'koopa install python-framework' to install.
brew "python@3.9", link: false

brew "ack"
brew "armadillo"
brew "autoconf"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bandcamp-dl"
brew "bash"
brew "bash-completion"
brew "bat"  # rust
brew "bc"
brew "bfg"
brew "binutils"
brew "black"  # python
brew "bpytop"  # python
brew "broot"  # rust
brew "ccache"
brew "checkbashisms"
brew "circleci"
brew "cmake"
brew "cmus"
brew "convmv"
brew "coreutils"
brew "curl"
brew "dash"
brew "dog"  # rust
brew "dust"  # rust
brew "editorconfig"
brew "exa"  # rust
brew "exiftool"
brew "fd"  # rust
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "flac"
brew "flake8"  # python
brew "fzf"
brew "gawk"
brew "gdal"
brew "git-lfs"
brew "gitui"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "go"
brew "gpatch"
brew "grep"
brew "groff"
brew "gsl"
brew "gzip"
brew "hadolint"
brew "hdf5"
brew "htop"
brew "httpd"
brew "hub"
brew "hyperfine"
brew "igraph"
brew "imagemagick"
brew "jq"
brew "ksh"
brew "lame"
brew "lapack"
brew "leiningen"
brew "lesspipe"
brew "libgit2"
brew "libiconv"
brew "libidn2"  # wget
brew "libomp"
brew "libpsl"  # wget
brew "libressl"
brew "librsvg"
brew "libssh2"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "lua"
brew "luarocks"
brew "make"
brew "man-db"
brew "mariadb-connector-c"
brew "mas"
brew "mkvtoolnix"
brew "mp4v2"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "oil"
brew "open-mpi"
brew "openblas"
brew "openjdk"
brew "openjdk@8"  # for nextflow
brew "openssh"
brew "osx-cpu-temp"
brew "pandoc"
brew "pandoc-crossref"
brew "parallel"
brew "pass"
brew "pcre"
brew "php"
brew "pipenv"  # python
brew "pkg-config"
brew "podofo"
brew "procs"  # rust
brew "proj"
brew "protobuf"
brew "pylint"  # python
brew "ranger"  # python
brew "rename"
brew "ripgrep"  # rust
brew "ripgrep-all"  # rust
brew "rsync"
brew "ruby"
brew "screen"
brew "shellcheck"
brew "shellharden"
brew "shunit2"
brew "sox"
brew "sqlite"
brew "starship"  # rust
brew "stow"
brew "taglib"
brew "tcl-tk"
brew "tcsh"
brew "tesseract"
brew "texinfo"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"  # rust
brew "udunits"
brew "v8"
brew "vim"
brew "wget"
brew "xsv"  # rust
brew "youtube-dl"
brew "zlib"
brew "zoxide"  # rust
brew "zsh"

# External brews {{{1
# ==============================================================================

# > brew "muesli/tap/duf"
brew "mongodb/brew/mongodb-community"
brew "vitorgalvao/tiny-scripts/cask-repair"

# App Store {{{1
# ==============================================================================

# > mas "Keynote", id: 409183694
# > mas "Numbers", id: 409203825
# > mas "Pages", id: 409201541

mas "AdGuard for Safari", id: 1440147259
mas "Calca", id: 635758264
mas "Disk Speed Test", id: 425264550
mas "Gapplin", id: 768053424
mas "Internet Access Policy Viewer", id: 1482630322
mas "Name Mangler", id: 603637384
mas "Pastebot", id: 1179623856
mas "Reeder", id: 880001334
mas "Soulver", id: 413965349
mas "Table Tool", id: 1122008420
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 1384080005
mas "iA Writer", id: 775737590
