# """
# Homebrew Cask Bundle Brewfile 03.
# Updated 2020-12-17.
#
# Consider:
# - fiji  # latest
# - onyx
# - oracle-jdk
# - wine-stable
#
# Requires authentication in 'Security & Privacy':
# - box-drive
# - virtualbox
#
# Removals:
# - 'foobar2000' cask was removed due to url protection.
# - 'macvim' cask overwrites 'vim' binary, so install manually instead.
# - 'powershell' installs into '/usr/local/microsoft'.
# - 'skype-for-business' is potentially useful but starts up at login.
# """

cask "aerial"
cask "airfoil"
cask "alacritty"
cask "authy"
cask "balenaetcher"
cask "brave-browser"
cask "calibre"
cask "coconutbattery"
cask "coda"
cask "darktable"
cask "deluge"
cask "github"
cask "google-drive-file-stream"
cask "handbrake"
cask "keka"
cask "kid3"
cask "kitty"
cask "makemkv"
cask "museeks"
cask "netnewswire"
cask "pacifist"
cask "photosweeper-x"
cask "scrivener"
cask "spillo"
cask "swinsian"
cask "tiny-player"
cask "tor-browser"
cask "tower"
cask "transmission"
cask "transmission-remote-gui"
cask "xld"

# Draft update, adding drivers.
tap "homebrew/cask-drivers"
cask "homebrew/cask-drivers/fujitsu-scansnap-home"
